# Многочлен
# Дана функция y=x^6+2x^4-15x^3+3x^2-2. (Здесь знак ^ обозначает возведение в степень).
# Дано значение х, выведите значение данной функции в точке х.

x = int(input())
y = x ** 6 + 2 * x ** 4 - 15 * x ** 3 + 3 * x ** 2 - 2
print(y)